The  PipingSystem  type exposes the following members.
 Methods
Name  |   Description
Add
 Add elements into the system and connect them with the system using given connectors.
 (Inherited from  MEPSystem  .)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from  Element  .)
CanBeHidden
 Indicates if the element can be hidden in the view.
 (Inherited from  Element  .)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from  Element  .)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from  Element  .)
CanHaveTypeAssigned
 Identifies if the element can have a type assigned.
 (Inherited from  Element  .)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from  Element  .)
Create(Document, ElementId)
 Creates a new instance of a piping system and adds it to the document.
Create(Document, ElementId, String)
 Creates a new instance of a piping system and adds it to the document.
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from  Element  .)
Dispose   |   (Inherited from  Element  .)
DivideSystem
 Divide the phyisical networks in the system and create a new system for each network.
 (Inherited from  MEPSystem  .)
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from  Element  .)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from  Element  .)
GetCriticalPathSectionNumbers
 Obtains a list of the critical path section numbers.
 (Inherited from  MEPSystem  .)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from  Element  .)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from  Element  .)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from  Element  .)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from  Element  .)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from  Element  .)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from  Element  .)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from  Element  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from  Element  .)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from  Element  .)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from  Element  .)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from  Element  .)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from  Element  .)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from  Element  .)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from  Element  .)
GetParameters
 Retrieves the parameters from the element via the given name.
 (Inherited from  Element  .)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from  Element  .)
GetPhysicalNetworksNumber
 Get the physical networks number in the system.
 (Inherited from  MEPSystem  .)
GetSectionByIndex
 Get the section from the index.
 (Inherited from  MEPSystem  .)
GetSectionByNumber
 Get the Section from section number
 (Inherited from  MEPSystem  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from  Element  .)
GetValidTypes
 Obtains a set of types that are valid for this element.
 (Inherited from  Element  .)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from  Element  .)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from  Element  .)
IsFlowServerMissing
 Indicates if any flow server which was used in the piping system is not available.
IsHidden
 Identifies if the element has been permanently hidden in the view.
 (Inherited from  Element  .)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from  Element  .)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from  Element  .)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from  Element  .)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from  Element  .)
IsPressureDropServerMissing
 Indicates if any pressure drop server which was used in the piping system is not available.
IsSystemDividable
 Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
 (Inherited from  MEPSystem  .)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from  Element  .)
LookupParameter
 Attempts to find a parameter on the element which has the given name.
 (Inherited from  Element  .)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from  Element  .)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from  Element  .)
Remove(ConnectorSet)
 Removes connectors from system.
 (Inherited from  MEPSystem  .)
Remove(ICollection ElementId )
 Remove elements from system.
 (Inherited from  MEPSystem  .)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from  Element  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  PipingSystem Class
  Autodesk.Revit.DB.Plumbing Namespace